## Plan output for docs config

```

Note: Objects have changed outside of OpenTofu

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.docs.local_file.pkg_json has been deleted
  - resource "local_file" "pkg_json" {
      - content              = jsonencode(
            {
              - dependencies = {
                  - "@aws-sdk/client-secrets-manager" = "^3.556"
                  - jose                              = "^5.2"
                }
              - description  = "Lambda@Edge function for OIDC authentication"
              - main         = "index.js"
              - name         = "cfa-documentation-development-oidc"
              - type         = "module"
              - version      = "1.0.0"
            }
        ) -> null
        id                   = "e013a0025c0e7abd85fee47f36a77c66c1d7b569"
        # (9 unchanged attributes hidden)
    }

  # module.docs.module.doppler.module.sync["this"].doppler_secrets_sync_aws_secrets_manager.this has been deleted
  - resource "doppler_secrets_sync_aws_secrets_manager" "this" {
      - id              = "86f9ba83-b54a-40b3-8eb9-1f39dc1cc4d4" -> null
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place (current -> planned)
-/+ destroy and then create replacement
 <= read (data resources)

OpenTofu will perform the following actions:

  # module.docs.data.archive_file.oidc will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "oidc" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "../../modules/docs/dist/oidc-function.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../../modules/docs/dist/oidc"
      + type                = "zip"
    }

  # module.docs.aws_cloudfront_distribution.endpoint will be updated in-place
  ~ resource "aws_cloudfront_distribution" "endpoint" {
        id                             = "E2ISS554TAP1I2"
        tags                           = {
            "application"    = "cfa-documentation-development"
            "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/cfa-documentation-development/0exl1gqfy25cyqyqiwbl3kno40"
            "environment"    = "development"
            "program"        = "engineering"
            "project"        = "cfa-documenation"
        }
        # (22 unchanged attributes hidden)

      ~ default_cache_behavior {
            # (12 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "viewer-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:816069131564:function:cfa-documentation-development-oidc:15" -> null
            }
          + lambda_function_association {
              + event_type   = "viewer-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.docs.aws_iam_policy.oidc_function will be updated in-place
  ~ resource "aws_iam_policy" "oidc_function" {
        id               = "arn:aws:iam::816069131564:policy/cfa-documentation-development-oidc-function"
        name             = "cfa-documentation-development-oidc-function"
      ~ tags             = {
          - "application" = "cfa-documentation-development" -> null
          - "project"     = "cfa-documentation" -> null
        }
      ~ tags_all         = {
          ~ "application" = "cfa-documentation-development" -> "shared-services-development"
          ~ "project"     = "cfa-documentation" -> "shared-services"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.docs.aws_iam_policy.prefix["cfa-security-controls"] will be created
  + resource "aws_iam_policy" "prefix" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow deploy access to cfa-security-controls in the documentation bucket"
      + id               = (known after apply)
      + name             = "cfa-documentation-development-deploy-cfa-security-controls"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:ListBucket",
                          + "s3:DeleteObject",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::docs.dev.services.cfa.codes",
                          + "arn:aws:s3:::docs.dev.services.cfa.codes/cfa-security-controls/*",
                        ]
                      + Sid      = "DocumentationPrefixPolicy"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "application" = "shared-services-development"
          + "environment" = "development"
          + "program"     = "engineering"
          + "project"     = "shared-services"
        }
    }

  # module.docs.aws_iam_policy.prefix["cmr-entity-resolution"] will be updated in-place
  ~ resource "aws_iam_policy" "prefix" {
        id               = "arn:aws:iam::816069131564:policy/cfa-documentation-development-deploy-cmr-entity-resolution"
        name             = "cfa-documentation-development-deploy-cmr-entity-resolution"
      ~ tags             = {
          - "application" = "cfa-documentation-development" -> null
          - "project"     = "cfa-documentation" -> null
        }
      ~ tags_all         = {
          ~ "application" = "cfa-documentation-development" -> "shared-services-development"
          ~ "project"     = "cfa-documentation" -> "shared-services"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.docs.aws_iam_policy.prefix["document-transfer-service"] will be updated in-place
  ~ resource "aws_iam_policy" "prefix" {
        id               = "arn:aws:iam::816069131564:policy/cfa-documentation-development-deploy-document-transfer-service"
        name             = "cfa-documentation-development-deploy-document-transfer-service"
      ~ tags             = {
          - "application" = "cfa-documentation-development" -> null
          - "project"     = "cfa-documentation" -> null
        }
      ~ tags_all         = {
          ~ "application" = "cfa-documentation-development" -> "shared-services-development"
          ~ "project"     = "cfa-documentation" -> "shared-services"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.docs.aws_iam_policy.prefix["shared-services"] will be updated in-place
  ~ resource "aws_iam_policy" "prefix" {
        id               = "arn:aws:iam::816069131564:policy/cfa-documentation-development-deploy-shared-services"
        name             = "cfa-documentation-development-deploy-shared-services"
      ~ tags             = {
          - "application" = "cfa-documentation-development" -> null
          - "project"     = "cfa-documentation" -> null
        }
      ~ tags_all         = {
          ~ "application" = "cfa-documentation-development" -> "shared-services-development"
          ~ "project"     = "cfa-documentation" -> "shared-services"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.docs.aws_iam_policy.prefix["tax-benefits-backend"] will be updated in-place
  ~ resource "aws_iam_policy" "prefix" {
        id               = "arn:aws:iam::816069131564:policy/cfa-documentation-development-deploy-tax-benefits-backend"
        name             = "cfa-documentation-development-deploy-tax-benefits-backend"
      ~ tags             = {
          - "application" = "cfa-documentation-development" -> null
          - "project"     = "cfa-documentation" -> null
        }
      ~ tags_all         = {
          ~ "application" = "cfa-documentation-development" -> "shared-services-development"
          ~ "project"     = "cfa-documentation" -> "shared-services"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.docs.aws_iam_policy.prefix["tofu-modules"] will be updated in-place
  ~ resource "aws_iam_policy" "prefix" {
        id               = "arn:aws:iam::816069131564:policy/cfa-documentation-development-deploy-tofu-modules"
        name             = "cfa-documentation-development-deploy-tofu-modules"
      ~ tags             = {
          - "application" = "cfa-documentation-development" -> null
          - "project"     = "cfa-documentation" -> null
        }
      ~ tags_all         = {
          ~ "application" = "cfa-documentation-development" -> "shared-services-development"
          ~ "project"     = "cfa-documentation" -> "shared-services"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.docs.aws_iam_role.oidc_function will be updated in-place
  ~ resource "aws_iam_role" "oidc_function" {
        id                    = "cfa-documentation-development-oidc-function"
        name                  = "cfa-documentation-development-oidc-function"
      ~ tags                  = {
          - "application" = "cfa-documentation-development" -> null
          - "project"     = "cfa-documentation" -> null
        }
      ~ tags_all              = {
          ~ "application" = "cfa-documentation-development" -> "shared-services-development"
          ~ "project"     = "cfa-documentation" -> "shared-services"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.docs.aws_kms_key.docs will be updated in-place
  ~ resource "aws_kms_key" "docs" {
        id                                 = "88916055-e852-467f-83c4-832f16692946"
      ~ tags                               = {
          - "application"    = "cfa-documentation-development" -> null
            "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/cfa-documentation-development/0exl1gqfy25cyqyqiwbl3kno40"
          - "project"        = "cfa-documentation" -> null
        }
      ~ tags_all                           = {
          ~ "application"    = "cfa-documentation-development" -> "shared-services-development"
          ~ "project"        = "cfa-documentation" -> "shared-services"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.docs.aws_lambda_function.oidc will be updated in-place
  ~ resource "aws_lambda_function" "oidc" {
        id                             = "cfa-documentation-development-oidc"
      ~ last_modified                  = "2025-10-29T23:56:21.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:816069131564:function:cfa-documentation-development-oidc:15" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:816069131564:function:cfa-documentation-development-oidc:15/invocations" -> (known after apply)
      ~ source_code_hash               = "x51AY5M1RHyhlcGT926uJxvgI77OhPsXKUOv+XX/8/M=" -> (known after apply)
        tags                           = {
            "application"    = "cfa-documentation-development"
            "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/cfa-documentation-development/0exl1gqfy25cyqyqiwbl3kno40"
            "environment"    = "development"
            "program"        = "engineering"
            "project"        = "cfa-documenation"
            "use"            = "edge-function"
        }
      ~ version                        = "15" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.docs.aws_s3_object.index will be updated in-place
  ~ resource "aws_s3_object" "index" {
      ~ content_base64         = "PCFET0NUWVBFIGh0bWw+CjxodG1sPgo8aGVhZD4KICA8c3R5bGU+CiAgICBsaSB7IHBhZGRpbmctbGVmdDogMC41ZW07IH0KCiAgICBsaS5wcml2YXRlOjptYXJrZXIgewogICAgICBjb250ZW50OiB1cmwoImRhdGE6aW1hZ2Uvc3ZnK3htbDtjaGFyc2V0PVVURi04LDxzdmcgeG1sbnM9J2h0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnJyBoZWlnaHQ9JzI0JyB3aWR0aD0nMjQnPjxwYXRoIHN0cm9rZS1saW5lY2FwPSdyb3VuZCcgc3Ryb2tlLWxpbmVqb2luPSdyb3VuZCcgZD0nTTEzLjUgMTAuNVY2Ljc1YTQuNSA0LjUgMCAxIDEgOSAwdjMuNzVNMy43NSAyMS43NWgxMC41YTIuMjUgMi4yNSAwIDAgMCAyLjI1LTIuMjV2LTYuNzVhMi4yNSAyLjI1IDAgMCAwLTIuMjUtMi4yNUgzLjc1YTIuMjUgMi4yNSAwIDAgMC0yLjI1IDIuMjV2Ni43NWEyLjI1IDIuMjUgMCAwIDAgMi4yNSAyLjI1WicgZmlsbD0nbm9uZScgc3Ryb2tlPSdyZWQnIHN0cm9rZS13aWR0aD0nMycgLz48L3N2Zz4iKQogICAgfQoKICAgIGxpLnB1YmxpYzo6bWFya2VyIHsKICAgICAgY29udGVudDogdXJsKCJkYXRhOmltYWdlL3N2Zyt4bWw7Y2hhcnNldD1VVEYtOCw8c3ZnIHhtbG5zPSdodHRwOi8vd3d3LnczLm9yZy8yMDAwL3N2ZycgaGVpZ2h0PScyNCcgd2lkdGg9JzI0Jz48cGF0aCBzdHJva2UtbGluZWNhcD0ncm91bmQnIHN0cm9rZS1saW5lam9pbj0ncm91bmQnIGQ9J00xNi41IDEwLjVWNi43NWE0LjUgNC41IDAgMSAwLTkgMHYzLjc1bS0uNzUgMTEuMjVoMTAuNWEyLjI1IDIuMjUgMCAwIDAgMi4yNS0yLjI1di02Ljc1YTIuMjUgMi4yNSAwIDAgMC0yLjI1LTIuMjVINi43NWEyLjI1IDIuMjUgMCAwIDAtMi4yNSAyLjI1djYuNzVhMi4yNSAyLjI1IDAgMCAwIDIuMjUgMi4yNVonIGZpbGw9J25vbmUnIHN0cm9rZT0nZ3JlZW4nIHN0cm9rZS13aWR0aD0nMycgLz48L3N2Zz4iKQogICAgfQogIDwvc3R5bGU+CiAgPHRpdGxlPkNvZGUgZm9yIEFtZXJpY2EgRW5naW5lZXJpbmcgRG9jdW1lbnRhdGlvbiAoRGV2ZWxvcG1lbnQpPC90aXRsZT4KPC9oZWFkPgo8Ym9keT4KICA8aDE+Q29kZSBmb3IgQW1lcmljYSBFbmdpbmVlcmluZyBEb2N1bWVudGF0aW9uIChEZXZlbG9wbWVudCk8L2gxPgoKICA8dWw+CiAgICAgICAgICA8bGkgY2xhc3M9InB1YmxpYyI+CiAgICAgICAgPGEgaHJlZj0iL2Ntci1lbnRpdHktcmVzb2x1dGlvbi8iPkNNUiBFbnRpdHkgUmVzb2x1dGlvbjwvYT4KICAgICAgPC9saT4KICAgICAgICAgIDxsaSBjbGFzcz0icHVibGljIj4KICAgICAgICA8YSBocmVmPSIvZG9jdW1lbnQtdHJhbnNmZXItc2VydmljZS8iPkRvY3VtZW50IFRyYW5zZmVyIFNlcnZpY2U8L2E+CiAgICAgIDwvbGk+CiAgICAgICAgICA8bGkgY2xhc3M9InB1YmxpYyI+CiAgICAgICAgPGEgaHJlZj0iL3NoYXJlZC1zZXJ2aWNlcy8iPkNvZGUgZm9yIEFtZXJpY2EgU2hhcmVkIFNlcnZpY2VzPC9hPgogICAgICA8L2xpPgogICAgICAgICAgPGxpIGNsYXNzPSJwdWJsaWMiPgogICAgICAgIDxhIGhyZWY9Ii90YXgtYmVuZWZpdHMtYmFja2VuZC8iPlRheCBCZW5lZml0cyBCYWNrZW5kPC9hPgogICAgICA8L2xpPgogICAgICAgICAgPGxpIGNsYXNzPSJwdWJsaWMiPgogICAgICAgIDxhIGhyZWY9Ii90b2Z1LW1vZHVsZXMvIj5Db2RlIGZvciBBbWVyaWNhIE9wZW5Ub2Z1IE1vZHVsZXM8L2E+CiAgICAgIDwvbGk+CiAgICAgIDwvdWw+CjwvYm9keT4KPC9odG1sPgo=" -> "PCFET0NUWVBFIGh0bWw+CjxodG1sPgo8aGVhZD4KICA8c3R5bGU+CiAgICBsaSB7IHBhZGRpbmctbGVmdDogMC41ZW07IH0KCiAgICBsaS5wcml2YXRlOjptYXJrZXIgewogICAgICBjb250ZW50OiB1cmwoImRhdGE6aW1hZ2Uvc3ZnK3htbDtjaGFyc2V0PVVURi04LDxzdmcgeG1sbnM9J2h0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnJyBoZWlnaHQ9JzI0JyB3aWR0aD0nMjQnPjxwYXRoIHN0cm9rZS1saW5lY2FwPSdyb3VuZCcgc3Ryb2tlLWxpbmVqb2luPSdyb3VuZCcgZD0nTTEzLjUgMTAuNVY2Ljc1YTQuNSA0LjUgMCAxIDEgOSAwdjMuNzVNMy43NSAyMS43NWgxMC41YTIuMjUgMi4yNSAwIDAgMCAyLjI1LTIuMjV2LTYuNzVhMi4yNSAyLjI1IDAgMCAwLTIuMjUtMi4yNUgzLjc1YTIuMjUgMi4yNSAwIDAgMC0yLjI1IDIuMjV2Ni43NWEyLjI1IDIuMjUgMCAwIDAgMi4yNSAyLjI1WicgZmlsbD0nbm9uZScgc3Ryb2tlPSdyZWQnIHN0cm9rZS13aWR0aD0nMycgLz48L3N2Zz4iKQogICAgfQoKICAgIGxpLnB1YmxpYzo6bWFya2VyIHsKICAgICAgY29udGVudDogdXJsKCJkYXRhOmltYWdlL3N2Zyt4bWw7Y2hhcnNldD1VVEYtOCw8c3ZnIHhtbG5zPSdodHRwOi8vd3d3LnczLm9yZy8yMDAwL3N2ZycgaGVpZ2h0PScyNCcgd2lkdGg9JzI0Jz48cGF0aCBzdHJva2UtbGluZWNhcD0ncm91bmQnIHN0cm9rZS1saW5lam9pbj0ncm91bmQnIGQ9J00xNi41IDEwLjVWNi43NWE0LjUgNC41IDAgMSAwLTkgMHYzLjc1bS0uNzUgMTEuMjVoMTAuNWEyLjI1IDIuMjUgMCAwIDAgMi4yNS0yLjI1di02Ljc1YTIuMjUgMi4yNSAwIDAgMC0yLjI1LTIuMjVINi43NWEyLjI1IDIuMjUgMCAwIDAtMi4yNSAyLjI1djYuNzVhMi4yNSAyLjI1IDAgMCAwIDIuMjUgMi4yNVonIGZpbGw9J25vbmUnIHN0cm9rZT0nZ3JlZW4nIHN0cm9rZS13aWR0aD0nMycgLz48L3N2Zz4iKQogICAgfQogIDwvc3R5bGU+CiAgPHRpdGxlPkNvZGUgZm9yIEFtZXJpY2EgRW5naW5lZXJpbmcgRG9jdW1lbnRhdGlvbiAoRGV2ZWxvcG1lbnQpPC90aXRsZT4KPC9oZWFkPgo8Ym9keT4KICA8aDE+Q29kZSBmb3IgQW1lcmljYSBFbmdpbmVlcmluZyBEb2N1bWVudGF0aW9uIChEZXZlbG9wbWVudCk8L2gxPgoKICA8dWw+CiAgICAgICAgICA8bGkgY2xhc3M9InB1YmxpYyI+CiAgICAgICAgPGEgaHJlZj0iL2NmYS1zZWN1cml0eS1jb250cm9scy8iPkNvZGUgZm9yIEFtZXJpY2EgU2VjdXJpdHkgQ29udHJvbHM8L2E+CiAgICAgIDwvbGk+CiAgICAgICAgICA8bGkgY2xhc3M9InB1YmxpYyI+CiAgICAgICAgPGEgaHJlZj0iL2Ntci1lbnRpdHktcmVzb2x1dGlvbi8iPkNNUiBFbnRpdHkgUmVzb2x1dGlvbjwvYT4KICAgICAgPC9saT4KICAgICAgICAgIDxsaSBjbGFzcz0icHVibGljIj4KICAgICAgICA8YSBocmVmPSIvZG9jdW1lbnQtdHJhbnNmZXItc2VydmljZS8iPkRvY3VtZW50IFRyYW5zZmVyIFNlcnZpY2U8L2E+CiAgICAgIDwvbGk+CiAgICAgICAgICA8bGkgY2xhc3M9InB1YmxpYyI+CiAgICAgICAgPGEgaHJlZj0iL3NoYXJlZC1zZXJ2aWNlcy8iPkNvZGUgZm9yIEFtZXJpY2EgU2hhcmVkIFNlcnZpY2VzPC9hPgogICAgICA8L2xpPgogICAgICAgICAgPGxpIGNsYXNzPSJwdWJsaWMiPgogICAgICAgIDxhIGhyZWY9Ii90YXgtYmVuZWZpdHMtYmFja2VuZC8iPlRheCBCZW5lZml0cyBCYWNrZW5kPC9hPgogICAgICA8L2xpPgogICAgICAgICAgPGxpIGNsYXNzPSJwdWJsaWMiPgogICAgICAgIDxhIGhyZWY9Ii90b2Z1LW1vZHVsZXMvIj5Db2RlIGZvciBBbWVyaWNhIE9wZW5Ub2Z1IE1vZHVsZXM8L2E+CiAgICAgIDwvbGk+CiAgICAgIDwvdWw+CjwvYm9keT4KPC9odG1sPgo="
        id                     = "index.html"
      ~ tags                   = {
          - "application" = "cfa-documentation-development" -> null
          - "project"     = "cfa-documentation" -> null
        }
      ~ tags_all               = {
          ~ "application" = "cfa-documentation-development" -> "shared-services-development"
          ~ "project"     = "cfa-documentation" -> "shared-services"
            # (2 unchanged elements hidden)
        }
      ~ version_id             = "vSmyoOwOKynJ4YdpO0imJoeT6mYClbUU" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.docs.aws_s3_object.robots will be updated in-place
  ~ resource "aws_s3_object" "robots" {
        id                     = "robots.txt"
      ~ tags                   = {
          - "application" = "cfa-documentation-development" -> null
          - "project"     = "cfa-documentation" -> null
        }
      ~ tags_all               = {
          ~ "application" = "cfa-documentation-development" -> "shared-services-development"
          ~ "project"     = "cfa-documentation" -> "shared-services"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)
    }

  # module.docs.local_file.lambda_js will be created
  + resource "local_file" "lambda_js" {
      + content              = <<-EOT
            /**
             * Lambda@Edge Function for Okta Authentication
             *
             * This function intercepts requests at a CloudFront edge location to enforce
             * authentication via the OpenID Connect (OIDC) with Okta.
             *
             * How it works:
             *
             * 1. On a viewer request, it checks for a valid session JWT (id_token)
             * 2. If the JWT is missing or invalid, it redirects the user to the Okta login
             *    page
             * 3. After Okta login, the user is redirected back to a /callback URL
             * 4. The function handles the /callback, exchanges the authorization code from
             *    Okta for an ID token, validates the token, and sets a secure cookie
             * 5.  For all later requests, the function allows access to the S3 content
             */
            import { SecretsManagerClient, GetSecretValueCommand } from '@aws-sdk/client-secrets-manager';
            import * as jose from 'jose';
            import { randomBytes } from 'crypto';
            import { stringify as stringifyQuery, parse as parseQuery } from 'querystring';
            
            const SECRET_ARN = 'arn:aws:secretsmanager:us-east-1:816069131564:secret:cfa-documentation/development/OIDC_SETTINGS-tNftAV';
            const DOMAIN = "https://codeforamerica.okta.com";
            const CALLBACK_PATH = '/_callback';
            const LOGOUT_PATH = '/_logout';
            const COOKIE_SETTINGS = 'Path=/; Secure; HttpOnly; SameSite=Lax';
            const SESSION_DURATION_SECONDS = 8 * 60 * 60; // 8 hours
            const ID_TOKEN_COOKIE_NAME = 'IdToken';
            const NONCE_COOKIE_NAME = 'Nonce';
            
            const PROTECTED_PATHS = [
              ]
            
            
            // Cache secrets and JWKS in the global scope to reuse across warm invocations.
            let cachedSecrets = null;
            let cachedJwks = null;
            
            /**
             * Fetches secrets from AWS Secrets Manager.
             *
             * Caches the result in a global variable for subsequent invocations.
             *
             * @returns {Promise<object>} The parsed JSON object of secrets.
             */
            async function getSecrets() {
              if (cachedSecrets) {
                console.log('Using cached secrets.');
                return cachedSecrets;
              }
            
              console.log(`Fetching secrets from ARN: ${SECRET_ARN}`);
              const secretsClient = new SecretsManagerClient({ region: 'us-east-1' });
              const command = new GetSecretValueCommand({ SecretId: SECRET_ARN });
            
              try {
                const data = await secretsClient.send(command);
                if ('SecretString' in data) {
                  cachedSecrets = JSON.parse(data.SecretString);
                  return cachedSecrets;
                }
            
                throw new Error('SecretString not found in Secrets Manager response.');
              } catch (error) {
                console.error('Failed to fetch secrets:', error);
                throw new Error('Could not retrieve secrets from AWS Secrets Manager.');
              }
            }
            
            /**
             * Fetches the JSON Web Key Set (JWKS) from the Okta authorization server.
             *
             * Caches the result for reuse.
             *
             * @param {string} oktaDomain The base URL of your Okta domain.
             * @returns {jose.JWKSet} A key set that can be used by the jose library.
             */
            async function getJwks(oktaDomain) {
              if (cachedJwks) {
                console.log('Using cached JWKS.');
                return cachedJwks;
              }
            
              console.log('Fetching JWKS from Okta.');
              const jwksUrl = new URL(`${oktaDomain}/oauth2/v1/keys`);
              cachedJwks = jose.createRemoteJWKSet(jwksUrl);
            
              return cachedJwks;
            }
            
            /**
             * The main handler function executed by Lambda@Edge.
             */
            export const handler = async (event) => {
              const { request } = event.Records[0].cf;
              const domainName = request.headers.host[0].value;
              const requestedUri = `${request.uri}${request.querystring ? '?' + request.querystring : ''}`;
            
              console.log(`Request for URI: ${requestedUri}`);
            
              try {
                const secrets = await getSecrets();
            
                // Route request based on the path.
                switch (request.uri) {
                  case CALLBACK_PATH:
                    return handleAuthCallback(request, secrets, domainName);
                  case LOGOUT_PATH:
                    return handleLogout(secrets, domainName);
                  default:
                    request.uri = rewriteUri(request.uri);
            
                    // If this path matches any of the protected paths, we need to
                    // verify the user's authentication status.
                    if (PROTECTED_PATHS.some(pattern => pattern.test(request.uri))) {
                      console.log('Protected path detected, verifying authentication.');
                      return verifyAuthentication(request, secrets, domainName, requestedUri);
                    }
            
                    return request;
                }
              } catch (error) {
                console.error('Unhandled error in handler:', error);
                return {
                  status: '500',
                  statusDescription: 'Internal Server Error',
                  body: 'An unexpected error occurred. Please check the logs.',
                };
              }
            };
            
            /**
             * Rewrites the request URI to ensure it points to the correct S3 object.
             *
             * @param {string} requestUri The original request URI.
             * @returns {*|string}
             */
            function rewriteUri(requestUri) {
              // If the request is being made to a directory (e.g. / or /docs), we want to
              // append "index.html" so that S3 serves the proper object. If the path
              // doesn't contain a file extension, we assume it's a directory as well.
              if (requestUri.endsWith('/')) {
                return `${requestUri}index.html`;
              } else if (!requestUri.includes('.')) {
                return `${requestUri}/index.html`;
              }
            
              return requestUri;
            }
            
            /**
             * Verifies if the user has a valid session cookie and redirects to Okta login
             * if not.
             *
             * @param {object} request The CloudFront request object.
             * @param {object} secrets The Okta secrets.
             * @param {string} domainName The domain of the request.
             * @param {string} requestedUri The original URI the user requested.
             * @returns {Promise<object>} A request or redirect response.
             */
            async function verifyAuthentication(request, secrets, domainName, requestedUri) {
              const cookies = parseCookies(request.headers);
              const idToken = cookies[ID_TOKEN_COOKIE_NAME];
            
              if (!idToken) {
                console.log('No IdToken cookie found. Redirecting to login.');
                return redirectToLogin(request, secrets, domainName, requestedUri);
              }
            
              try {
                console.log('Verifying IdToken...');
                const jwks = await getJwks(DOMAIN);
                const { payload } = await jose.jwtVerify(idToken, jwks, {
                  issuer: DOMAIN,
                  audience: secrets.client_id,
                });
            
                // The token is valid, allow the request to proceed to the origin.
                console.log(`Token verified for user: ${payload.sub}`);
                return request;
              } catch (err) {
                // The token is invalid or expired; redirect to log in.
                console.error('IdToken verification failed:', err.message);
                return redirectToLogin(request, secrets, domainName, requestedUri);
              }
            }
            
            /**
             * Handles the OIDC callback from Okta.
             *
             * @param {object} request The CloudFront request object.
             * @param {object} secrets The Okta secrets.
             * @param {string} domainName The domain of the request.
             * @returns {Promise<object>} A redirect response.
             */
            async function handleAuthCallback(request, secrets, domainName) {
              const cookies = parseCookies(request.headers);
              const query = parseQuery(request.querystring);
              const { code, state } = query;
            
              // Validate state to prevent CSRF.
              const decodedState = JSON.parse(Buffer.from(state, 'base64').toString());
              if (decodedState.nonce !== cookies[NONCE_COOKIE_NAME]) {
                throw new Error('Invalid state parameter. Possible CSRF attack.');
              }
            
              // Exchange authorization code for tokens.
              console.log('Exchanging authorization code for tokens...');
              const tokenEndpoint = new URL(`${DOMAIN}/oauth2/v1/token`);
              const redirectUri = `https://${domainName}${CALLBACK_PATH}`;
              const basicAuth = Buffer.from(`${secrets.client_id}:${secrets.client_secret}`).toString('base64');
            
              const tokenResponse = await fetch(tokenEndpoint.toString(), {
                method: 'POST',
                headers: {
                  'Content-Type': 'application/x-www-form-urlencoded',
                  'Authorization': `Basic ${basicAuth}`,
                },
                body: stringifyQuery({
                  grant_type: 'authorization_code',
                  code,
                  redirect_uri: redirectUri,
                }),
              });
            
              if (!tokenResponse.ok) {
                const errorBody = await tokenResponse.text();
                throw new Error(`Failed to exchange code for token: ${errorBody}`);
                }
            
                const { id_token } = await tokenResponse.json();
            
                // Create redirect response with the session cookie.
                console.log('Token received. Setting session cookie and redirecting .');
                return {
                    status: '302',
                    statusDescription: 'Found',
                    headers: {
                        'location': [{ key: 'Location', value: decodedState.requestedUri }],
                        'set-cookie': [
                            { key: 'Set-Cookie', value: `${ID_TOKEN_COOKIE_NAME}=${id_token}; Max-Age=${SESSION_DURATION_SECONDS}; ${COOKIE_SETTINGS}` },
                            { key: 'Set-Cookie', value: `${NONCE_COOKIE_NAME}=; Max-Age=0; ${COOKIE_SETTINGS}` }, // Clear nonce
                        ],
                    },
                };
            }
            
            /**
             * Generates a redirect response to the Okta login page.
             *
             * @param {object} request The CloudFront request object.
             * @param {object} secrets The Okta secrets.
             * @param {string} domainName The domain of the request.
             * @param {string} requestedUri The original URI the user requested.
             * @returns {object} A redirect response object.
             */
            function redirectToLogin(request, secrets, domainName, requestedUri) {
                const nonce = randomBytes(16).toString('hex');
                const state = Buffer.from(JSON.stringify({ nonce, requestedUri })).toString('base64');
                const redirectUri = `https://${domainName}${CALLBACK_PATH}`;
            
                const loginParams = stringifyQuery({
                    response_type: 'code',
                    client_id: secrets.client_id,
                    redirect_uri: redirectUri,
                    scope: 'openid profile email',
                    state,
                    nonce,
                });
            
                const loginUrl = `${DOMAIN}/oauth2/v1/authorize?${loginParams}`;
            
                return {
                    status: '302',
                    statusDescription: 'Found',
                    headers: {
                        'location': [{ key: 'Location', value: loginUrl }],
                        'set-cookie': [{ key: 'Set-Cookie', value: `${NONCE_COOKIE_NAME}=${nonce}; ${COOKIE_SETTINGS}` }],
                    },
                };
            }
            
            /**
             * Clears session cookies and redirects to the Okta logout URL.
             *
             * @param {object} secrets The Okta secrets.
             * @param {string} domainName The domain of the request.
             * @returns {object} A redirect response object.
             */
            function handleLogout(secrets, domainName) {
                const postLogoutRedirectUri = `https://${domainName}`;
                const logoutUrl = `${DOMAIN}/oauth2/v1/logout?post_logout_redirect_uri=${encodeURIComponent(postLogoutRedirectUri)}`;
            
                console.log('Logging out user.');
                return {
                    status: '302',
                    statusDescription: 'Found',
                    headers: {
                        'location': [{ key: 'Location', value: logoutUrl }],
                        'set-cookie': [
                            { key: 'Set-Cookie', value: `${ID_TOKEN_COOKIE_NAME}=; Max-Age=0; ${COOKIE_SETTINGS}` },
                            { key: 'Set-Cookie', value: `${NONCE_COOKIE_NAME}=; Max-Age=0; ${COOKIE_SETTINGS}` },
                        ],
                    },
                };
            }
            
            /**
             * Parses cookies from request headers.
             *
             * @param {object} headers The request headers object.
             * @returns {object} A key-value map of cookies.
             */
            function parseCookies(headers) {
                const cookies = {};
                if (headers.cookie) {
                    headers.cookie[0].value.split(';').forEach(cookie => {
                        if (cookie) {
                            const parts = cookie.split('=');
                            const name = parts[0].trim();
                            const value = parts.slice(1).join('=').trim();
                            if (name && value) {
                                cookies[name] = value;
                            }
                        }
                    });
                }
            
                return cookies;
            }
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../modules/docs/dist/oidc/index.js"
      + id                   = (known after apply)
    }

  # module.docs.local_file.pkg_json will be created
  + resource "local_file" "pkg_json" {
      + content              = jsonencode(
            {
              + dependencies = {
                  + "@aws-sdk/client-secrets-manager" = "^3.556"
                  + jose                              = "^5.2"
                }
              + description  = "Lambda@Edge function for OIDC authentication"
              + main         = "index.js"
              + name         = "cfa-documentation-development-oidc"
              + type         = "module"
              + version      = "1.0.0"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../modules/docs/dist/oidc/package.json"
      + id                   = (known after apply)
    }

  # module.docs.null_resource.npm_install must be replaced
-/+ resource "null_resource" "npm_install" {
      ~ id       = "2738694129783888760" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "modules_exist"     = "true" -> "false"
            # (1 unchanged element hidden)
        }
    }

  # module.redirect.aws_acm_certificate.this will be updated in-place
  ~ resource "aws_acm_certificate" "this" {
        id                        = "arn:aws:acm:us-east-1:816069131564:certificate/0b38100b-6702-4d8c-a24c-d127e1e39fee"
      ~ tags                      = {
          - "application" = "cfa-documentation-development" -> null
          - "project"     = "cfa-documentation" -> null
        }
      ~ tags_all                  = {
          ~ "application" = "cfa-documentation-development" -> "shared-services-development"
          ~ "project"     = "cfa-documentation" -> "shared-services"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.redirect.aws_cloudfront_distribution.this will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
        id                             = "E1XSALEFUP7RFA"
      ~ tags                           = {
          - "application" = "cfa-documentation-development" -> null
          - "project"     = "cfa-documentation" -> null
        }
      ~ tags_all                       = {
          ~ "application" = "cfa-documentation-development" -> "shared-services-development"
          ~ "project"     = "cfa-documentation" -> "shared-services"
            # (2 unchanged elements hidden)
        }
        # (20 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.docs.module.doppler.module.sync["this"].doppler_secrets_sync_aws_secrets_manager.this will be created
  + resource "doppler_secrets_sync_aws_secrets_manager" "this" {
      + config          = "dev"
      + delete_behavior = "leave_in_target"
      + id              = (known after apply)
      + integration     = "caa19df9-2d68-4718-a5dd-ddec19bd26b0"
      + path            = "cfa-documentation/development"
      + path_behavior   = "none"
      + project         = "cfa-documentation"
      + region          = "us-east-1"
      + sync_strategy   = "multi-secret"
      + update_metadata = false
    }

Plan: 5 to add, 14 to change, 1 to destroy.

Changes to Outputs:
  ~ prefixes                       = [
      + "cfa-security-controls",
        "cmr-entity-resolution",
        # (4 unchanged elements hidden)
    ]

Warning: Deprecated attribute

  on .terraform/modules/docs.bucket/locals.tf line 4, in locals:
   4:   region          = data.aws_region.current.name

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 9 more similar warnings elsewhere)

Warning: Object attribute is ignored

  on ../../modules/docs/main.tf line 11, in module "secrets":
   9:     OIDC_SETTINGS = {
  10:       description = "OIDC credentials for static documentation hosting"
  11:       type        = "json"
  12:       start_value = jsonencode({
  13:         client_id     = "abc",
  14:         client_secret = "123",
  15:       })
  16:     }

The object type for input variable "secrets" nested value ["OIDC_SETTINGS"]
does not include an attribute named "type", so this definition is unused.

Warning: Doppler Error: Could not find requested config 'dev'

  with module.docs.module.doppler.module.sync["this"].doppler_secrets_sync_aws_secrets_manager.this,
  on .terraform/modules/docs.doppler/modules/sync/main.tf line 6, in resource "doppler_secrets_sync_aws_secrets_manager" "this":
   6: resource "doppler_secrets_sync_aws_secrets_manager" "this" {

Resource was not found, so it was removed from state and is being recreated.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "tfplan"

```